--use [HRP-GHSS2014晋汇总]
--use [HRP-GHSS2008]

--处理唯一ID重复的情况
select a0102,ha0102,k0101,k0108,k0109,k0114,hk3989,kwyid from k01 where kwyid in (
select kwyid from k01 group by kwyid having count(*)>1
) order by a0102

update k01 set kwyid=null where k0101='G2001' and k0108='85.193'
update k01 set kwyid=null  where kwyid in (
select kwyid from k01 group by kwyid having count(*)>1
) and left(k0101,1)='G'
update k01 set kwyid=null where k0101='X007140221' and k0108='19.130'
update k01 set kwyid=null where k0101='X834140829' and k0108='9.635'
update k01 set kwyid=null where k0101='T45' and k0108='325.094'

----给空唯一id赋值

UPDATE K01 SET KWYID=NEWID() where KWYID is null--1894
UPDATE K60 SET KWYID=NEWID() where KWYID is null--514
UPDATE K63 SET KWYID=NEWID() where KWYID is null--67

insert L01 --86144
(A0101,hA0101,--时间
A0102,hA0102,--管理单位名称
A0103,hA0103,--行政区划
A0320,--晴雨通车里程
A0322,--已实施GBM里程
A0323,--已实施文明样板路的里程
A0522,--涵洞(道)
A0523,--涵洞(米)
A1001,--养护里程
A1314,--管养单位名称
A3101,--可绿化里程
A3102,--已绿化里程
A3219,hA3219,--建设性质
A7002,--路线地方名称
BG0101,--变更时间
BG0102,hBG0102,--变更类型
BG0103,--变更前路线代码
BG0104,--变更前起点桩号
BG0105,--变更前止点桩号
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
BG0131,hBG0131,--变更指标1
BG0132,hBG0132,--变更指标2
BG0133,hBG0133,--变更指标3
BG0199,--备注
K0101,--路线代码
K0108,--路段起点桩号
K0109,--路段止点桩号
K0110,--路段起点名称
K0111,--路段止点名称
K0112,--路线简称
K0114,--里程
K0115,--路段编号
K0116,--通车日期
K0117,--变更日期
K0120,hK0120,--是否收费路段
K0121,hK0121,--是否城管路段
K0123,hK0123,--是否断头路路段
K0124,--重复路线代码
K0126,hK0126,--是否一幅高速
K0128,hK0128,--路段收费性质
K0130,hK0130,--养护类型(按时间分)
K0131,hK0131,--养护类型(按资金来源分)
K0133,--设置班队(个)
K0153,hK0153,--起点是否为分界点
K0154,hK0154,--起点分界点类别
K0155,--最近一次大中修年度
K0156,hK0156,--省际出入口标识
K0157,hK0157,--止点是否为分界点
K0158,hK0158,--止点分界点类别
K0161,hK0161,--重复路段管理单位名称
K0162,--重复路段起点桩号
K0163,--重复路段止点桩号
K0180,hK0180,--修建年度
K0181,hK0181,--改建年度
K0182,hK0182,--断链类型
K0199,--备注
K0304,hK0304,--技术等级
K0306,--设计车速(公里/小时)
K0404,hK0404,--车道分类
K1015,--最小平曲线半径
K1116,--最大纵坡
K2010,hK2010,--管养单位行业类别
K3231,--路缘镶边(公里)
K3232,--路肩黑色化(公里)
K3233,--绿化平台(公里)
K3234,--路树成活率(%)
K3235,--标志标线齐全(公里)
K3236,--年平均好路率(%)
K3921,--亚洲公路网编号
K3922,--省内顺序号
K3989,hK3989,--路网调整前管理单位名称
K3990,--路网调整前路线代码
K3991,--路网调整前路段起点桩号
K3992,--国省道桩号传递预留里程
K3993,--路网调整说明
K4002,--路基宽度
K5104,hK5104,--面层类型
K5222,--面层厚度(厘米)
K5404,--路面宽度
K9508,hK9508,--地貌
KWYID, --唯一ID
k1302,--上年路线编码
k1303,--上年起点桩号
k1304--上年止点桩号
)
select
rtrim(A0101),rtrim(hA0101),--时间
rtrim(A0102),rtrim(hA0102),--管理单位名称
rtrim(A0103),rtrim(hA0103),--行政区划
A0320,--晴雨通车里程
A0322,--已实施GBM里程
A0323,--已实施文明样板路的里程
A0522,--涵洞(道)
A0523,--涵洞(米)
A1001,--养护里程
A1314,--管养单位名称
A3101,--可绿化里程
A3102,--已绿化里程
rtrim(A3219),rtrim(hA3219),--建设性质
A7002,--路线地方名称
BG0101,--变更时间
rtrim(BG0102),rtrim(hBG0102),--变更类型
BG0103,--变更前路线代码
BG0104,--变更前起点桩号
BG0105,--变更前止点桩号
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
rtrim(BG0131),rtrim(hBG0131),--变更指标1
rtrim(BG0132),rtrim(hBG0132),--变更指标2
rtrim(BG0133),rtrim(hBG0133),--变更指标3
BG0199,--备注
K0101,--路线代码
K0108,--路段起点桩号
K0109,--路段止点桩号
K0110,--路段起点名称
K0111,--路段止点名称
K0112,--路线简称
K0114,--里程
K0115,--路段编号
K0116,--通车日期
K0117,--变更日期
rtrim(K0120),rtrim(hK0120),--是否收费路段
rtrim(K0121),rtrim(hK0121),--是否城管路段
rtrim(K0123),rtrim(hK0123),--是否断头路路段
K0124,--重复路线代码
rtrim(K0126),rtrim(hK0126),--是否一幅高速
rtrim(K0128),rtrim(hK0128),--路段收费性质
rtrim(K0130),rtrim(hK0130),--养护类型(按时间分)
rtrim(K0131),rtrim(hK0131),--养护类型(按资金来源分)
K0133,--设置班队(个)
rtrim(K0153),rtrim(hK0153),--起点是否为分界点
rtrim(K0154),rtrim(hK0154),--起点分界点类别
K0155,--最近一次大中修年度
rtrim(K0156),rtrim(hK0156),--省际出入口标识
rtrim(K0157),rtrim(hK0157),--止点是否为分界点
rtrim(K0158),rtrim(hK0158),--止点分界点类别
rtrim(K0161),rtrim(hK0161),--重复路段管理单位名称
K0162,--重复路段起点桩号
K0163,--重复路段止点桩号
rtrim(K0180),rtrim(hK0180),--修建年度
rtrim(K0181),rtrim(hK0181),--改建年度
rtrim(K0182),rtrim(hK0182),--断链类型
K0199,--备注
rtrim(K0304),rtrim(hK0304),--技术等级
K0306,--设计车速(公里/小时)
rtrim(K0404),rtrim(hK0404),--车道分类
K1015,--最小平曲线半径
K1116,--最大纵坡
rtrim(K2010),rtrim(hK2010),--管养单位行业类别
K3231,--路缘镶边(公里)
K3232,--路肩黑色化(公里)
K3233,--绿化平台(公里)
K3234,--路树成活率(%)
K3235,--标志标线齐全(公里)
K3236,--年平均好路率(%)
K3921,--亚洲公路网编号
K3922,--省内顺序号
rtrim(K3989),rtrim(hK3989),--路网调整前管理单位名称
K3990,--路网调整前路线代码
K3991,--路网调整前路段起点桩号
K3992,--国省道桩号传递预留里程
K3993,--路网调整说明
K4002,--路基宽度
rtrim(K5104),rtrim(hK5104),--面层类型
K5222,--面层厚度(厘米)
K5404,--路面宽度
rtrim(K9508),rtrim(hK9508),--地貌
KWYID, --唯一ID
k1302,--上年路线编码
k1303,--上年起点桩号
k1304--上年止点桩号
from k01


/*
BG0101,--变更时间
rtrim(BG0102),rtrim(hBG0102),--变更类型
BG0103,--变更前路线代码
BG0104,--变更前起点桩号
BG0105,--变更前止点桩号
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
rtrim(BG0131),rtrim(hBG0131),--变更指标1
rtrim(BG0132),rtrim(hBG0132),--变更指标2
rtrim(BG0133),rtrim(hBG0133),--变更指标3
BG0199,--备注
*/


insert L60  --14661
(A0101,hA0101,--时间
A0102,hA0102,--管理单位名称
A0103,hA0103,--行政区划
A0521,--匝道(平米)
A1302,hA1302,--收费性质
A1305,--评定日期
A1307,hA1307,--已采取交通管制措施
A1313,hA1313,--管养单位性质
A1314,--管养单位名称
A1316,--改造完工日期
A1317,hA1317,--改造部位
A1318,hA1318,--工程性质
A1319,hA1319,--是否部补助项目
A1328,hA1328,--墩台防撞设施类型
A3219,hA3219,--建设性质
A6066,--桥梁全宽(米)
BG0101,--变更时间
BG0103,--变更前路线代码
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
BG0202,hBG0202,--变更类型
BG0203,--变更前桥梁代码
BG0231,hBG0231,--变更指标1
BG0232,hBG0232,--变更指标2
BG0233,hBG0233,--变更指标3
BG0299,--备注
K0101,--路线代码
K0112,--路线简称
K0116,--通车日期
K0117,--变更日期
K0180,hK0180,--修建年度
K0183,hK0183,--改造年度
K0199,--备注
K6001,--桥梁代码
K6002,--桥梁名称
K6003,--桥梁中心桩号(KM)
K6004,hK6004,--桥梁性质
K6005,hK6005,--跨越地物类型
K6006,--跨越地物名称
K6007,hK6007,--桥梁跨径分类
K6008,--桥梁全长(米)
K6009,--桥面净宽(米)
K6010,--主桥孔数
K6011,--主桥主跨
K6012,--主桥边跨
K6013,--前引桥长
K6014,--后引桥长
K6015,--桥下净空(米)
K6016,hK6016,--上部结构形式
K6017,hK6017,--桥墩类型
K6018,hK6018,--桥台类型
K6019,hK6019,--桥面铺装类型
K6020,hK6020,--伸缩缝类型
K6021,hK6021,--支座类型
K6022,hK6022,--设计荷载等级
K6023,hK6023,--抗震等级
K6024,hK6024,--通航等级
K6025,--弯坡斜特征
K6026,--竣工日期
K6028,hK6028,--技术状况评定
K6029,--总造价(万元)
K6030,--设计单位名称
K6031,--施工单位名称
K6032,--监理单位名称
K6033,hK6033,--桥梁验算荷载
K6034,--监管单位名称
K6035,hK6035,--上部结构材料
K6050,--技术状况评定单位
K6051,--改造施工单位
K6060,--设计洪水频率(年)
K6062,hK6062,--立交桥类别
K6063,--单孔最大跨径(米)
K6064,--桥梁跨径组合(孔*米)
K6065,--跨径总长(米)
K6068,hK6068,--下部结构形式
K6069,--人行道宽
K6070,--桥梁所在地点
K6079,--建设单位名称
K6091,hK6091,--主要病害位置
K6093,--主要病害描述
K6115,hK6115,--路网调整后行政等级
KWYID --唯一ID
)
select
rtrim(A0101),rtrim(hA0101),--时间
rtrim(A0102),rtrim(hA0102),--管理单位名称
rtrim(A0103),rtrim(hA0103),--行政区划
A0521,--匝道(平米)
rtrim(A1302),rtrim(hA1302),--收费性质
A1305,--评定日期
rtrim(A1307),rtrim(hA1307),--已采取交通管制措施
rtrim(A1313),rtrim(hA1313),--管养单位性质
A1314,--管养单位名称
A1316,--改造完工日期
rtrim(A1317),rtrim(hA1317),--改造部位
rtrim(A1318),rtrim(hA1318),--工程性质
rtrim(A1319),rtrim(hA1319),--是否部补助项目
rtrim(A1328),rtrim(hA1328),--墩台防撞设施类型
rtrim(A3219),rtrim(hA3219),--建设性质
A6066,--桥梁全宽(米)
BG0101,--变更时间
BG0103,--变更前路线代码
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
rtrim(BG0202),rtrim(hBG0202),--变更类型
BG0203,--变更前桥梁代码
rtrim(BG0231),rtrim(hBG0231),--变更指标1
rtrim(BG0232),rtrim(hBG0232),--变更指标2
rtrim(BG0233),rtrim(hBG0233),--变更指标3
BG0299,--备注
K0101,--路线代码
K0112,--路线简称
K0116,--通车日期
K0117,--变更日期
rtrim(K0180),rtrim(hK0180),--修建年度
rtrim(K0183),rtrim(hK0183),--改造年度
K0199,--备注
K6001,--桥梁代码
K6002,--桥梁名称
K6003,--桥梁中心桩号(KM)
rtrim(K6004),rtrim(hK6004),--桥梁性质
rtrim(K6005),rtrim(hK6005),--跨越地物类型
K6006,--跨越地物名称
rtrim(K6007),rtrim(hK6007),--桥梁跨径分类
K6008,--桥梁全长(米)
K6009,--桥面净宽(米)
K6010,--主桥孔数
K6011,--主桥主跨
K6012,--主桥边跨
K6013,--前引桥长
K6014,--后引桥长
K6015,--桥下净空(米)
rtrim(K6016),rtrim(hK6016),--上部结构形式
rtrim(K6017),rtrim(hK6017),--桥墩类型
rtrim(K6018),rtrim(hK6018),--桥台类型
rtrim(K6019),rtrim(hK6019),--桥面铺装类型
rtrim(K6020),rtrim(hK6020),--伸缩缝类型
rtrim(K6021),rtrim(hK6021),--支座类型
rtrim(K6022),rtrim(hK6022),--设计荷载等级
rtrim(K6023),rtrim(hK6023),--抗震等级
rtrim(K6024),rtrim(hK6024),--通航等级
K6025,--弯坡斜特征
K6026,--竣工日期
rtrim(K6028),rtrim(hK6028),--技术状况评定
K6029,--总造价(万元)
K6030,--设计单位名称
K6031,--施工单位名称
K6032,--监理单位名称
rtrim(K6033),rtrim(hK6033),--桥梁验算荷载
K6034,--监管单位名称
rtrim(K6035),rtrim(hK6035),--上部结构材料
K6050,--技术状况评定单位
K6051,--改造施工单位
K6060,--设计洪水频率(年)
rtrim(K6062),rtrim(hK6062),--立交桥类别
K6063,--单孔最大跨径(米)
K6064,--桥梁跨径组合(孔*米)
K6065,--跨径总长(米)
rtrim(K6068),rtrim(hK6068),--下部结构形式
K6069,--人行道宽
K6070,--桥梁所在地点
K6079,--建设单位名称
rtrim(K6091),rtrim(hK6091),--主要病害位置
K6093,--主要病害描述
rtrim(K6115),rtrim(hK6115),--路网调整后行政等级
KWYID --唯一ID
from k60


/*
BG0101,--变更时间
BG0103,--变更前路线代码
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
rtrim(BG0202),rtrim(hBG0202),--变更类型
BG0203,--变更前桥梁代码
rtrim(BG0231),rtrim(hBG0231),--变更指标1
rtrim(BG0232),rtrim(hBG0232),--变更指标2
rtrim(BG0233),rtrim(hBG0233),--变更指标3
BG0299,--备注
*/


insert L63  --943
(A0101,hA0101,--时间
A0102,hA0102,--管理单位名称
A0103,hA0103,--行政区划
A1305,--评定日期
A1313,hA1313,--管养单位性质
A1314,--管养单位名称
A1316,--改造完工日期
A1318,hA1318,--工程性质
A3219,hA3219,--建设性质
BG0101,--变更时间
BG0103,--变更前路线代码
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
BG0302,hBG0302,--变更类型
BG0303,--变更前隧道代码
BG0331,hBG0331,--变更指标1
BG0332,hBG0332,--变更指标2
BG0333,hBG0333,--变更指标3
BG0399,--备注
K0101,--路线代码
K0112,--路线简称
K0116,--通车日期
K0117,--变更日期
K0180,hK0180,--修建年度
K0181,hK0181,--改建年度
K0199,--备注
K6050,--技术状况评定单位
K6079,--建设单位名称
K6115,hK6115,--路网调整后行政等级
K6301,--隧道代码
K6302,--隧道名称
K6303,--隧道入口桩号(KM)
K6304,hK6304,--隧道按长度分类
K6305,--隧道长度(米)
K6306,--隧道净宽(米)
K6307,--隧道净高(米)
K6308,--人行道宽(米)
K6309,hK6309,--洞口形式
K6310,hK6310,--断面形式
K6311,hK6311,--衬砌材料
K6312,hK6312,--路面面层类型
K6313,hK6313,--隧道排水类型
K6314,--安全通道数量
K6315,hK6315,--隧道照明
K6316,hK6316,--隧道通风
K6317,hK6317,--隧道电子设备
K6318,--消防设施
K6319,--隧道修建日期
K6320,--设计单位名称
K6321,--施工单位名称
K6322,--监理单位名称
K6323,hK6323,--养护单位
K6324,--隧道中心桩号(KM)
K6326,--隧道所在地点
K6327,--隧道全宽(米)
K6335,hK6335,--是否水下隧道
K6336,hK6336,--技术状况评定
K6337,hK6337,--改造部位
K6338,hK6338,--主要病害部位
K6339,--主要病害描述
K6340,--监管单位名称
KWYID --唯一ID
)
select
rtrim(A0101),rtrim(hA0101),--时间
rtrim(A0102),rtrim(hA0102),--管理单位名称
rtrim(A0103),rtrim(hA0103),--行政区划
A1305,--评定日期
rtrim(A1313),rtrim(hA1313),--管养单位性质
A1314,--管养单位名称
A1316,--改造完工日期
rtrim(A1318),rtrim(hA1318),--工程性质
rtrim(A3219),rtrim(hA3219),--建设性质
BG0101,--变更时间
BG0103,--变更前路线代码
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
rtrim(BG0302),rtrim(hBG0302),--变更类型
BG0303,--变更前隧道代码
rtrim(BG0331),rtrim(hBG0331),--变更指标1
rtrim(BG0332),rtrim(hBG0332),--变更指标2
rtrim(BG0333),rtrim(hBG0333),--变更指标3
BG0399,--备注
K0101,--路线代码
K0112,--路线简称
K0116,--通车日期
K0117,--变更日期
rtrim(K0180),rtrim(hK0180),--修建年度
rtrim(K0181),rtrim(hK0181),--改建年度
K0199,--备注
K6050,--技术状况评定单位
K6079,--建设单位名称
rtrim(K6115),rtrim(hK6115),--路网调整后行政等级
K6301,--隧道代码
K6302,--隧道名称
K6303,--隧道入口桩号(KM)
rtrim(K6304),rtrim(hK6304),--隧道按长度分类
K6305,--隧道长度(米)
K6306,--隧道净宽(米)
K6307,--隧道净高(米)
K6308,--人行道宽(米)
rtrim(K6309),rtrim(hK6309),--洞口形式
rtrim(K6310),rtrim(hK6310),--断面形式
rtrim(K6311),rtrim(hK6311),--衬砌材料
rtrim(K6312),rtrim(hK6312),--路面面层类型
rtrim(K6313),rtrim(hK6313),--隧道排水类型
K6314,--安全通道数量
rtrim(K6315),rtrim(hK6315),--隧道照明
rtrim(K6316),rtrim(hK6316),--隧道通风
rtrim(K6317),rtrim(hK6317),--隧道电子设备
K6318,--消防设施
K6319,--隧道修建日期
K6320,--设计单位名称
K6321,--施工单位名称
K6322,--监理单位名称
rtrim(K6323),rtrim(hK6323),--养护单位
K6324,--隧道中心桩号(KM)
K6326,--隧道所在地点
K6327,--隧道全宽(米)
rtrim(K6335),rtrim(hK6335),--是否水下隧道
rtrim(K6336),rtrim(hK6336),--技术状况评定
rtrim(K6337),rtrim(hK6337),--改造部位
rtrim(K6338),rtrim(hK6338),--主要病害部位
K6339,--主要病害描述
K6340,--监管单位名称
KWYID --唯一ID
from k63

/*
BG0101,--变更时间
BG0103,--变更前路线代码
BG0109,--变更原因
BG0110,--填报人
BG0111,--审核人
rtrim(BG0302),rtrim(hBG0302),--变更类型
BG0303,--变更前隧道代码
rtrim(BG0331),rtrim(hBG0331),--变更指标1
rtrim(BG0332),rtrim(hBG0332),--变更指标2
rtrim(BG0333),rtrim(hBG0333),--变更指标3
BG0399,--备注
*/




update K01 set BG0101=nullif(BG0101,BG0101),BG0102=nullif(BG0102,BG0102),HBG0102=nullif(HBG0102,HBG0102),BG0103=nullif(BG0103,BG0103),
		BG0104=nullif(BG0104,BG0104),BG0105=nullif(BG0105,BG0105),BG0131=nullif(BG0131,BG0131),HBG0131=nullif(HBG0131,HBG0131),
		BG0132=nullif(BG0132,BG0132),HBG0132=nullif(HBG0132,HBG0132),BG0133=nullif(BG0133,BG0133),HBG0133=nullif(HBG0133,HBG0133),
		BG0109=nullif(BG0109,BG0109),BG0110=nullif(BG0110,BG0110),BG0111=nullif(BG0111,BG0111)

update k60 set BG0101=nullif(BG0101,BG0101),BG0202=nullif(BG0202,BG0202),HBG0202=nullif(HBG0202,HBG0202),BG0103=nullif(BG0103,BG0103),
		BG0203=nullif(BG0203,BG0203),BG0231=nullif(BG0231,BG0231),HBG0231=nullif(HBG0231,HBG0231),
		BG0232=nullif(BG0232,BG0232),HBG0232=nullif(HBG0232,HBG0232),BG0233=nullif(BG0233,BG0233),HBG0233=nullif(HBG0233,HBG0233),
		BG0109=nullif(BG0109,BG0109),BG0110=nullif(BG0110,BG0110),BG0111=nullif(BG0111,BG0111)

update k63 set BG0101=nullif(BG0101,BG0101),BG0302=nullif(BG0302,BG0302),HBG0302=nullif(HBG0302,HBG0302),BG0103=nullif(BG0103,BG0103),
		BG0303=nullif(BG0303,BG0303),BG0331=nullif(BG0331,BG0331),HBG0331=nullif(HBG0331,HBG0331),
		BG0332=nullif(BG0332,BG0332),HBG0332=nullif(HBG0332,HBG0332),BG0333=nullif(BG0333,BG0333),HBG0333=nullif(HBG0333,HBG0333),
		BG0109=nullif(BG0109,BG0109),BG0110=nullif(BG0110,BG0110),BG0111=nullif(BG0111,BG0111)

delete L01 where a0101='2014'
delete L60 where a0101='2014'
delete L63 where a0101='2014'

update K01 set k0101=upper(rtrim(K0101))
update K01 set k1302=upper(rtrim(k1302)) where k1302 is not null--72
update l01 set k0101=upper(rtrim(K0101))
update l01 set k1302=upper(rtrim(k1302)) where k1302 is not null--72
update K60 set k0101=upper(rtrim(K0101))
update l60 set k0101=upper(rtrim(K0101))
update K63 set k0101=upper(rtrim(K0101))
update l63 set k0101=upper(rtrim(K0101))

backup database [HRP-GHSS2008_2016晋汇总_含高速]
to disk = 'E:\喻骏\公路文件夹\2_工作记录按业务分类\2017山西年报\HRP-GHSS2008_2016山西全省汇总年报(结转2017年后备份2)'