SELECT 
'K063'+'&A0102 ='''+RTRIM(CAST(k063.A0102 AS VARCHAR))+''' AND K0101='''+RTRIM(CAST(k063.K0101 AS VARCHAR))+''' AND K6301 ='+RTRIM(CAST(k063.K6301 AS VARCHAR))  AS 编辑, 

RTRIM(K001.A0102) '管理单位代码' ,RTRIM(K001.HA0102) '管理单位名称',
K063.K6302 '年报|隧道名称',	ZCPT_K063.K6302 '资产平台|隧道名称',
rtrim(replace(replace(replace(replace(replace(k063.k0101,'340000',''),'000000',''),'D001',''),'D002',''),'D003',''))+left(k063.a0103,6)+'U'+k063.k6301 '年报|隧道代码',	ZCPT_K063.SDDM '资产平台|隧道代码',
K063.K6303 '年报|隧道入口桩号',	ZCPT_K063.K6303 '资产平台|隧道入口桩号',
K063.k0101 '年报|路线编号',	ZCPT_K063.k0101 '资产平台|路线编号',
K063.K0112 '年报|路线名称',	ZCPT_K063.K0112 '资产平台|路线名称',
K001.k0304 '年报|技术等级',	ZCPT_K063.k0304 '资产平台|技术等级',
K063.K6305 '年报|隧道长度（米）',	ZCPT_K063.K6305 '资产平台|隧道长度（米）',
K063.K6306 '年报|隧道净宽（米）',	ZCPT_K063.K6306 '资产平台|隧道净宽（米）',
K063.K6307 '年报|隧道净高（米）',	ZCPT_K063.K6307 '资产平台|隧道净高（米）',
K063.K6304 '年报|按隧道长度分类代码',	ZCPT_K063.K6304 '资产平台|按隧道长度分类代码',
K063.hK6304 '年报|按隧道长度分类汉字',	ZCPT_K063.hK6304 '资产平台|按隧道长度分类汉字 ',
K063.K6355 '年报|是否在长大隧道目录中',	ZCPT_K063.K6355 '资产平台|是否在长大隧道目录中',
K063.K0185 '年报|经度',	ZCPT_K063.K0185 '资产平台|经度',
K063.K0186 '年报|纬度',	ZCPT_K063.K0186 '资产平台|纬度',
K063.A0103 '年报|所在政区代码',	ZCPT_K063.A0103 '资产平台|所在政区代码',
K063.K6370 '年报|隧道所在位置',	ZCPT_K063.K6370 '资产平台|隧道所在位置',-----!!!!!!!!!!!!!!!!!!未找到对应值！！！！！！！！！！！
K063.K6335 '年报|是否水下隧道',	ZCPT_K063.K6335 '资产平台|是否水下隧道',
K063.K0180 '年报|修建年度',	ZCPT_K063.K0180 '资产平台|修建年度',
K063.K6371 '年报|是否跨省隧道',	ZCPT_K063.K6371 '资产平台|是否跨省隧道',

K063.K6343 '年报|隧道养护等级',	ZCPT_K063.K6343 '资产平台|隧道养护等级',
K063.K6079 '年报|建设单位名称',	ZCPT_K063.K6079 '资产平台|建设单位名称',
K063.K6030 '年报|设计单位名称',	ZCPT_K063.K6030 '资产平台|设计单位名称',
K063.K6031 '年报|施工单位名称',	ZCPT_K063.K6031 '资产平台|施工单位名称',
K063.K6032 '年报|监理单位名称',	ZCPT_K063.K6032 '资产平台|监理单位名称',
K063.K0116 '年报|建成通车时间',	ZCPT_K063.K0116 '资产平台|建成通车时间',

K063.A1313 '年报|单位性质代码',	ZCPT_K063.A1313 '资产平台|单位性质代码',
K063.A0130 '年报|管养单位名称',	ZCPT_K063.A0130 '资产平台|管养单位名称',
K063.K6111 '年报|监管单位名称',	ZCPT_K063.K6111 '资产平台|监管单位名称'

from ZCPT_K063
left join k063 on ZCPT_K063.SDDM= rtrim(replace(replace(replace(replace(replace(k063.k0101,'340000',''),'000000',''),'D001',''),'D002',''),'D003',''))+left(k063.a0103,6)+'U'+k063.k6301
left join k001 on rtrim(k063.k0101)=rtrim(k001.k0101) and k063.k6324>=k001.k0108 and k063.k6324<=k001.k0109
where   k063.A0102 LIKE '34%' AND k063.A0102 LIKE '34%' and
--where  k001.A0102 LIKE '#A0102#%' AND k001.A0102 LIKE '#GLDW#%' and
(

rtrim(K063.K6302) <>rtrim(ZCPT_K063.K6302) or --隧道名称
rtrim(replace(replace(replace(replace(replace(k063.k0101,'340000',''),'000000',''),'D001',''),'D002',''),'D003',''))+left(k063.a0103,6)+'U'+rtrim(k063.k6301) <> rtrim(ZCPT_K063.SDDM) or --隧道代码
isnull(K063.K6303,0) <> isnull(ZCPT_K063.K6303,0) or   --隧道入口桩号

rtrim(K063.k0101) <>	rtrim(ZCPT_K063.k0101) or--路线编号
rtrim(K063.K0112) <>	rtrim(ZCPT_K063.K0112) or--路线名称
K001.k0304 <>	ZCPT_K063.k0304 or--技术等级

isnull(K063.K6305,0) <>isnull(ZCPT_K063.K6305,0) or --隧道长度（米）
isnull(K063.K6306,0) <>isnull(ZCPT_K063.K6306,0) or --隧道净宽（米）
isnull(K063.K6307,0) <>isnull(ZCPT_K063.K6307,0) or--隧道净高（米）

K063.K6304 <>	ZCPT_K063.K6304 or --按隧道长度分类代码',
K063.hK6304 <>	ZCPT_K063.hK6304 or --按隧道长度分类汉字 ',
K063.K6355 <>	ZCPT_K063.K6355 or -- 是否在长大隧道目录中',


K063.K0185 <>ZCPT_K063.K0185 or --经度',
K063.K0186 <>	ZCPT_K063.K0186 or --纬度',
K063.A0103 <>	ZCPT_K063.A0103 or --所在政区代码',

K063.K6335 <>	ZCPT_K063.K6335 or --是否水下隧道',
K063.K6371 <>	ZCPT_K063.K6371 or --是否跨省隧道',

K063.HK6343<>	ZCPT_K063.K6343 --隧道养护等级',


K063.K6079 <>	ZCPT_K063.K6079 OR --建设单位名称',
K063.K6030 <>	ZCPT_K063.K6030 OR --设计单位名称',
K063.K6031 <>	ZCPT_K063.K6031 OR --施工单位名称',
K063.K6032 <>	ZCPT_K063.K6032 OR --监理单位名称',
K063.K0116 <>	ZCPT_K063.K0116 OR --建成通车时间',

)





ORDER BY  sddm