use [HRP-GHSS2015]
--公路路线基本情况明细表--
select 
case 
when K0101 like '[G,S]%' then left(K0101,4)
else K0101
end
 '路线编号',A0102 '行政代码',K0112 '路线名称', K0110 '起点名称',K0111 '止点',K1303 '起点桩号',K0109 '止点桩号',
K0114 '里程',K0304 '技术',HK0304 '技术等级',K0126 '是否一幅高速',K0404 '车道数量',K5104 '面层代码',HK5104 '面层类型',K4002 '路基宽度',
K5404 '路面宽度',K5222 '面层厚度',K0306 '设计时速',K0180 '修建年度',K0181 '改建年度',K0155 '最近一次修复养护年度',
K0182'断链类型',K0121 '是否城管路段',K0123 '是否断头路段',K0140 '路段收费性质',K0124 '重复路线编号',K0162'起点桩号',K0163 '终点桩号',
A1001 '养护里程',A3101 '可绿化里程',A3102 '已绿化里程',K9508 '地貌代码',HK9508 '汉字',A0522 '涵洞数量',A0130 '管养单位名称',
K0156 '省际出入口',
case 
when K3990 like '[G,S]%' then left(K3990,4)
else K3990
end
 '国道调整前路线编码',
isnull(HK0138,'否') '是否按干线公路管理接养',BG0199 '备注'
from dbo.K01

where K0101 like 'G%' or K0101 like 'S%' or K0101 like 'X%'

order by K0101