--use [HRP-GHSS2015]
--公路隧道明细表--
select distinct K.K6302 '隧道名称',K.K6301'隧道代码',K.K6324 '隧道中心桩号',K.K0101 '路线编号',K.K0112 '路线名称',K1.HK0304 '技术等级',K.K6305 '隧道长度',K.K6306 '隧道净宽',K.K6307 '隧道净高',
K.K6304 '隧道按长度分类代码',K.HK6304 '隧道按长度分类',K.HK6335 '是否水下隧道',K.K6319 '修建年度',K.K6079 '建设单位名称',K.K6320 '设计单位名称',K.K6321 '施工单位名称',
K.K6322 '监理单位名称',K.K0116 '建成通车时间',K.HK6343 '隧道养护等级',K.A1313'管养单位代码',K.HA1313 '管养单位名称',
K.K6340 '监管单位名称',K.HK6336 '总体评定等级',K.K6344 '总体评定日期',K.K6345 '总体评定单位',K.HK6346 '土建结构等级',isnull(K.K6347,'') '土建结构评定日期',isnull(K.K6348,'') '土建结构评定单位',isnull(K.K6349,'') '机电设施等级',
isnull(K.K6350,'') '机电设施日期',isnull(K.K6351,'') '机电设施单位',isnull(K.K6352,'') '其他工程设施等级',isnull(K.K6353,'') '其他工程设施日期',isnull(K.K6354,'') '其他工程设施单位',
isnull(K.K0181,'') '改造年度',K.A1316 '完工日期',K.HK6337 '改造部位',K.HA1318 '工程性质',K.HK6338 '病害部位',K.K6339 '病害描述',K.A0102 '所在政区代码',K.HK6355 '是否在长大隧道目录中',isnull(cast(K.K0199 as varchar(100)),'') '备注'

from K63 K ,K01 K1

where K.K0101 = K1.K0101 and K.K6324 between K1.K0108 and K1.K0109

