use [HRP-GHSS2015]
--公路桥梁明细表二--
select distinct K.K6002 '桥梁名称',substring(K.K6001,12,3) '桥梁代码',K.K6003 '桥梁中心桩号',substring(K.K0101,6,4) '所属路线情况编号',K.K0112 '所属路线情况名称', K1.HK0304 '所属路线情况等级',
K.K6008 '桥梁全长',K.K6065 '跨径总长', K.K6063  '单孔最大跨径',
K.A6066 '桥梁全宽',K.K6009  '桥面净宽', K.K6007  '按跨径分类代码',K.HK6007 '按跨径分类类型',
K.K6004 '按使用年限分类代码',K.HK6004 '按使用年限分类类型', K.K6016  '主桥上部结构类型代码',
K.HK6016 '主桥上部结构类型', K.K6022  '设计荷载等级代码', K.HK6022  '设计荷载等级',
K.K6062 '是否互通立交',K.K0180 '修建年度',K.K0116  '建成通车日期', K.K6028 '技术状况评定情况评定等级代码',K.HK6028  '技术状况评定情况评定等级',K.A1314 '管养单位名称',
isnull( K.A0103,'')  '所在政区代码', isnull(cast(K.K0199 as varchar(100)),'')  '备注',substring(K.K6001,2,10)

from K60 K,K01 K1

where K.K6001 like '[Y,Z,C]%' and K.K0101=K1.K0101 and K.K6003 between K1.K0108 and K1.K0109

order by substring(K.K6001,2,10),substring(K.K6001,12,3) desc