use [HRP-GHSS2015]
--公路桥梁明细表一--
select distinct K.K6002 '桥梁名称',K.K6001 '桥梁代码',K.K6003 '桥梁中心桩号',
case 
when K.K0101 like '[G,S]%' then left(K.K0101,4)
else K.K0101
end
 '所属路线情况编号',K.K0112 '所属路线情况名称',K1.HK0304 '所属路线情况等级',
K.K6008 '桥梁全长',K.K6065 '跨径总长', K.K6063  '单孔最大跨径',K.K6064 '跨径组合',
K.A6066 '桥梁全宽',K.K6009  '桥面净宽', K.K6007  '按跨径分类代码',K.HK6007 '按跨径分类类型',
K.K6004 '按使用年限分类代码',K.HK6004 '按使用年限分类类型', K.K6016  '结构类型代码',
K.HK6016 '结构类型类型',K.K6035  '材料代码', HK6035  '材料名称', K6017  '桥墩类型代码',
K.HK6017 '桥墩类型类型',K.K6022  '设计荷载等级代码', K.HK6022  '设计荷载等级',
K.K6023 '抗震等级代码',K.HK6023 '抗震等级', K.K6005  '跨越地物代码',
K.HK6005 '跨越地物类型',K.K6006  '跨越地物名称', K.K6024  '通航等级', K.A1328  '墩台防撞设施类型',
case K.K6062 
when 1 then '是'
else '否'
end
'是否互通立交',K.K6079  '建设单位', K.K6030  '设计单位', K.K6031  '施工单位',
K.K6032 '监理单位',K.K0180 '修建年度',K.K0116  '建成通车日期', K.A1313  '管养单位代码',
K.A1314 '管养单位名称',K6034  '监管单位名称', A1302  '收费性质代码', HA1302  '收费性质',
K.K6028 '技术状况评定情况评定等级代码',K.HK6028  '技术状况评定情况评定等级', K.A1305  '评定日期',
isnull(K.K6050,'')  '评定单位',isnull(K.K0183,'')  '改造年度', isnull(K.A1316,'')  '完工日期', isnull(K.A1317,'')  '改造部位',
isnull(K.A1318,'')  '工程性质',isnull(K.K6051,'')  '改造施工单位',isnull(K.HA1319,'否')  '是否部补助项目', isnull(K.HK6091,'')  '当前主要病害部位',
isnull(K.K6093,'') '当前主要病害',isnull(K.A1307,'1')  '交通管制措施代码',isnull(K.HA1307,'正常使用')  '交通管制措施',isnull( K.A0102,'')  '所在政区代码',
isnull(K.K6070,'')  '桥梁所在位置',isnull(K.HK6118,'')  '是否宽路窄桥',isnull(K.HK6119,'')  '是否在长大桥梁目录中', isnull(cast(K.K0199 as varchar(100)),'')  '备注',substring(K6001,10,1),substring(K6001,1,1),substring(K6001,14,1)

from K60 K,K01 K1

where K.K6001 like '[X,G,S]%' and K.K0101 = K1.K0101 and K.K6003 between K1.K0108 and K1.K0109

order by substring(K6001,10,1),substring(K6001,1,1),substring(K6001,14,1)

